glcloud/keil_v5/ARM/PACK/.Web/Keil.EFM32HGxxx_DFP.pdsc
        <!-- *************************  Device 'EFM32HG309F64'  ***************************** -->
        <device Dname="EFM32HG309F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG309F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG309F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG310'  **************************** -->
      <subFamily DsubFamily="EFM32HG310">
        <book name="Documents/EFM32HG310.pdf" title="EFM32HG310 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG310F32'  ***************************** -->
        <device Dname="EFM32HG310F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG310F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG310F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG310F64'  ***************************** -->
        <device Dname="EFM32HG310F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG310F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG310F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG321'  **************************** -->
      <subFamily DsubFamily="EFM32HG321">
        <book name="Documents/EFM32HG321.pdf" title="EFM32HG321 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG321F32'  ***************************** -->
        <device Dname="EFM32HG321F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG321F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG321F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG321F64'  ***************************** -->
        <device Dname="EFM32HG321F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG321F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG321F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG322'  **************************** -->
      <subFamily DsubFamily="EFM32HG322">
        <book name="Documents/EFM32HG322.pdf" title="EFM32HG322 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG322F32'  ***************************** -->
        <device Dname="EFM32HG322F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG322F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG322F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG322F64'  ***************************** -->
        <device Dname="EFM32HG322F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG322F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG322F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32HG350'  **************************** -->
      <subFamily DsubFamily="EFM32HG350">
        <book name="Documents/EFM32HG350.pdf" title="EFM32HG350 Data Sheet"/>

        <!-- *************************  Device 'EFM32HG350F32'  ***************************** -->
        <device Dname="EFM32HG350F32">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG350F32"/>
          <debug svd="SVD/EFM32HG/EFM32HG350F32.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32HG350F64'  ***************************** -->
        <device Dname="EFM32HG350F64">
          <compile header="Device/EFM32HG/Include/em_device.h"  define="EFM32HG350F64"/>
          <debug svd="SVD/EFM32HG/EFM32HG350F64.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32HG">
      <description>Silicon Labs EFM32HG device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32HG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32HG CMSIS">
      <description>Silicon Labs EFM32HG devices, CMSIS Core</description>
      <require condition="EFM32HG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32HG CMSIS GCC">
      <description>Silicon Labs EFM32HG devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32HG CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32HG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32HG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
